app/controllers/paintings_controller.rb

  def new
    @painting = Painting.new
    @parameter = Parameter.find_by id: session[:parameter_id]
---
SELECT  "parameters".* FROM "parameters" WHERE "parameters"."id" = ? LIMIT 1  [["id", 2]]

  def create
    @painting = Painting.new(painting_params)
    @painting.parameters_id = session[:parameter_id]
    if @painting.save
---
INSERT INTO "paintings" ("mark", "JsonData", "parameters_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["mark", 3], ["JsonData", ""], ["parameters_id", 1], ["created_at", "2018-01-15 10:07:02.016972"], ["updated_at", "2018-01-15 10:07:02.016972"]]

  def index
    @painting = Painting.find_by id: params[:id]
---
SELECT  "paintings".* FROM "paintings" WHERE "paintings"."id" = ? LIMIT 1  [["id", nil]]