app/controllers/parameters_controller.rb

INSERT INTO "parameters" ("nbRectBlack", "nbRectWhite", "progressif", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nbRectBlack", 3], ["nbRectWhite", 2], ["progressif", "f"], ["created_at", "2018-01-10 13:43:09.732253"], ["updated_at", "2018-01-10 13:43:09.732253"]]
---
  def create
    @parameter = Parameter.new(parameters_params) #Generate a new User instance using parameters collected from the form
    if @parameter.save

INSERT INTO "parameters" ("nbRectBlack", "nbRectWhite", "progressif", "users_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nbRectBlack", 1], ["nbRectWhite", 1], ["progressif", "f"], ["users_id", 1], ["created_at", "2018-01-15 11:06:57.551621"], ["updated_at", "2018-01-15 11:06:57.551621"]]
---
  def update
    @parameter = Parameter.new(parameters_params) #Generate a new User instance using parameters collected from the form
    if @parameter.save