app/views/parameters/home.html.erb

        <h2>Hello <%= session[:username] %>!</h2>
        <p>You have already rated <%= Painting.count(:joins => "LEFT JOIN parameters.users_id = session[:user_id]") %> paintings!</p>
---
SELECT COUNT(*) FROM "paintings"